{
    "title":["Entendendo o Jogo", "I: Destruir Inimigos","II: Apagar Chama","III: Diminuir Altura","IV: Upar Espada","V: Enganar Câmeras", "VI: Parar Blocos", "VII: Correr do Bicho", "VIII: Construir Caminho", "IX: Quebrar a 4ª Parede"],
    "description":["Nesse mundo programável você terá o poder de controlar situações por meio de códigos. Comece criando um apelido que o acompanhará durante todo o jogo. Afinal, não poderia começar a sua jornada sem um nome à altura!",
        "Olha essa quantidade de galinhas voadoras! Vai ser bem difícil matar todas elas no corpo a corpo. São 30 galinhas no total, mas você pode modificar essa quantidade, gravada numa variável, da forma que preferir. Legal, né? Lembre-se, com grandes poderes vêm grandes responsabilidades.",
        "Essa chama foi colocada de propósito, impossível um humano passar por ela. Mas você pode utilizar um comando para apagá-la. Vá em frente!",
        "Essa barreira praticamente transparente foi eficientemente feita para impedir passagens indevidas. O jeito é modificar a si mesmo, diminuindo a sua própria altura. Você sabe que mede 119,5 cm, e que a parte de você que coincide com a barreira mede 77,4 cm.",
        "É hora do easter egg! Descubra o código secreto de um caractere para upar sua espada em 50% para sempre. Para tanto, o código nunca mais deve mudar. Ele é baseado num ditado conhecido: \"Aquele que deixa tudo para trás, ouve o clamor de seu povo e reage, é grande.\" ",
        "Essas câmeras chatas podem colocar tudo a perder se te descobrirem. Você deve enganá-las trocando seus valores de forma que não enxerguem você. Tome cuidado!",
        "Você já deve ter percebido que os blocos caem assim que você pisa. Mas existem plataformas móveis que você precisa esperar. Escolha a melhor condição que permita que você espere pela plataforma sem o bloco cair. Não existe resposta errada, mas ela pode ser inútil.",
        "Se ficar o bicho pega, se correr o bicho come! Vem vindo um bicho atrás de você e você precisa se preparar. Crie uma condição para se livrar do bicho. Se fizer errado, ele vai te pegar!",
        "Existe um abismo entre você e a sua missão que não sabe onde termina. Você já chegou até aqui, consegue passar por ele criando rochas. Decida a melhor forma de criá-las para continuar.",
        "Bem que o teatro falava da 4ª parede. Há uma parede escondendo a passagem, que pode ser muito tortuosa. Não é bom arriscar. A parede possui 14 ladrilhos de altura e 12 de largura. Quebre cada ladrinho da 4ª parede para mostrar o caminho."
    ],
    "input":[{"options":["nomeDaVariável", "meuNome","1Nome","NOME_JOGADOR","nome_jogador","nome&sobrenome"]},
    {"options":["nomeDaVariável", "2DGalinhas","galinhas","quant_galinhas","quantGalinhas","g@linhas"]},
    {"options":["nomeDaVariável", "chamaAcesa","destruirChama","chamaApagada","criarChama","chama.acesa"]},
    {"options":["nomeDaVariável", "altura","ALTURAJogador","_alt_jog_","AlturaJogador","altura_jogador"]},
    {"options":["nomeDaVariável", "CODIGO_SECRETO","codigoSecreto","codigo","####","_senha"]},
    {"options":[null,null,null,null,null]},
    {"options":["Condição","(chamaAcesa == true)","(quantGalinhas >= 5 || codigo == '/')","(quantGalinhas < 0 && codigo == '!')","(alturaJogador == 0.00)","(quantGalinhas > 10)"]},
    {"options":["(correr())","(ficar() || correr())","(!ficar() && !correr())","((ficar() && correr()) || ficar())","((ficar() || correr()) || ficar())"]},
    {"options":["Iteração", "for(int i = 0; i < 6; i++)","while(houverRocha())","for(int i = 5; i <= 0; i--)", "while(houverVacuo())", "for(int i = 10; i >= 0; i++)"]},
    {"options":["Iteração","(int i = 0; i < 14; i++)","(int i = 0; i < 13; i++)","(int i = 0; i < 4; i++)", "(int i = 0; i <= 14; i++)", "(int i = 13; i >= 10; i--)"]}
    ],
    "options_for2":["Iteração","(int j = 0; j < 13; j++)", "(int j = 11; j >= 8; j--)", "(int j = 0; j < 12; j++)", "(float j = 0; j < 12; j++)", "(int j = 11; j <= 0; j++)"],
    "inputTypes":[{"options":["tipoDaVariável", "char[16]", "int", "float", "bool", "char"]},
    {"options":["tipoDaVariável", "string", "int", "float", "bool", "char"]},
    {"options":[null, null, null, null, null, null]},
    {"options":["tipoDaVariável", "String", "int", "float", "boolean", "char"]}
    ],
    "resultsStructures1":["oBichoPega();", "criarBloco();", null],
    "resultsStructures2":["oBichoCome();", null, "destruirBloco(i, j);"],
    "tips":[
        {"tips": ["Será que você não esqueceu as aspas no valor?", "Não se esqueça do ponto e vírgula", "Exemplo: \"Maria\";"]},
        {"tips": ["Nomes de variável não podem começar com número", "Não existe quantidade decimal, o valor é um número inteiro", "Você quer diminuir ao máximo possível a quantidade ou não?"]},
        {"tips": ["Nomes de variável não devem possuir verbos", "A depender do nome, o valor pode mudar", "Defina um valor bool true ou false"]},
        {"tips": ["Nomes de variável geralmente começam com letra minúscula", "A sua altura é ponto flutuante", "Subtraia a sua altura da intersecção"]},
        {"tips": ["O valor do código fica entre aspas simples", "Cada frase representa uma parte do nome do caractere", "O símbolo é composto de uma reta e de um ponto"]},
        {"tips": ["Você pode pôr o mesmo nome em mais de uma câmera", "Para uma câmera não te ver troque por outra mais distante", "A99 e A98 não pode te ver, então só resta A97"]},
        {"tips": ["Analise a possibilidade de cada um acontecer", "Tome cuidado com valores impossíveis", "Escolha a chama"]},
        {"tips": ["Você sempre corre ou fica, decida qual", "Analise uma expressão que retorna falso nos dois casos", "Você deve escolher correr como verdade"]},
        {"tips": ["Tome cuidado com loops infinitos", "Você sabe quantas rochas precisa?", "Enquanto houver vácuo é a expresão mais condinzente"]},
        {"tips": ["Como o índice começa do 0, nunca deve alcançar o valor máximo", "Remover alguns ladrilhos de baixo é suficiente", "i < 14 e j < 13"]}
    ]
}