{
    "title":["Entendendo o Jogo", "I: Destruir Inimigos","II: Apagar Chama","III: Upar Espada","IV: Diminuir Altura","V: Aumentar Altura","VI: Enganar Câmeras", "VII: Parar Blocos", "VIII: Ficar Livre", "IX: Correr do Bicho", "X: Construir Caminho", "XI: Eliminar Lâminas", "XII: Quebrar a 4ª Parede"],
    "description":["Nesse mundo programável você terá o poder de controlar situações por meio de códigos. Comece criando um apelido que o acompanhará durante todo o jogo. Afinal, não poderia começar a sua jornada sem um nome à altura!",
        "Olha essa quantidade de galinhas voadoras! Vai ser bem difícil matar todas elas no corpo a corpo. São 30 galinhas no total, mas você pode modificar essa quantidade, gravada numa variável, da forma que preferir. Legal, né? Lembre-se, com grandes poderes vêm grandes responsabilidades.",
        "Essa chama foi colocada de propósito, impossível um humano passar por ela. Mas você pode utilizar um comando para apagá-la. Vá em frente!",
        "É hora do easter egg! Descubra o código secreto de um caractere para upar sua espada em 50% para sempre. Para tanto, o código nunca mais deve mudar. Ele é baseado num ditado conhecido: \"Aquele que deixa tudo para trás, ouve o clamor de seu povo e reage, é grande.\" ",
        "Essa barreira praticamente transparente foi eficientemente feita para impedir passagens indevidas. O jeito é modificar a si mesmo, diminuindo a sua própria altura. Você sabe que mede 119,5 cm, e que a parte de você que coincide com a barreira mede 79,3 cm.",
        "Agora essas nuvens enfurecidas superam seu peso e não te deixam avançar. Para conseguir continuar, você precisa ficar gigante o suficiente para esmagá-las. Altere o valor da variável anterior, aumentando em 7,43 vezes o valor anterior.",
        "Essas câmeras chatas podem colocar tudo a perder se te descobrirem. Você deve enganá-las trocando seus valores de forma que não enxerguem você. Tome cuidado!",
        "Você já deve ter percebido que os blocos caem assim que você pisa. Mas existem plataformas móveis que você precisa esperar. Escolha a melhor condição que permita que você espere pela plataforma sem o bloco cair. Não existe resposta errada, mas ela pode ser inútil. Confira o significado dos novos comandos apertando ESC ou P e visitando a seção Condicionais.",
        "A plataforma à frente prende qualquer um que ouse pisá-la. Escolha a melhor condição que lhe permita prosseguir sem amarras!",
        "Se ficar o bicho pega, se correr o bicho come! Vem vindo um bicho atrás de você e você precisa se preparar. Crie uma condição para se livrar do bicho. Se fizer errado, ele vai te pegar!",
        "Existe um abismo entre você e a sua missão que não sabe onde termina. Você já chegou até aqui, consegue passar por ele criando rochas. Decida a melhor forma de criá-las para continuar. Confira o significado dos novos comandos apertando ESC ou P e visitando a seção Repetição.",
        "Você está perto do seu objetivo, mas encontrou uma barreira de lâminas. É preciso eliminá-las. Encontre uma forma de destruir todas de uma vez.",
        "Bem que o teatro falava da 4ª parede. Há uma parede escondendo a passagem, que pode ser muito tortuosa. Não é bom arriscar. A parede possui 7 ladrilhos de altura e 12 de largura. Quebre cada ladrinho da 4ª parede para mostrar o caminho."
    ],
    "input":[{"options":["nomeDaVariável", "meu-Nome","1Nome","NOME_JOGADOR","nome_jogador!","nome&sobrenome"]},
    {"options":["nomeDaVariável", "2DGalinhas","qt|galinhas","quant_galinhas","quantGalinhas","g@linhas"]},
    {"options":["nomeDaVariável", "chamaAcesa","destruirChama()","chamaApagada","criarChama()","chama.acesa"]},
    {"options":["nomeDaVariável", "CODIGO_SECRETO","codigo$ecreto","código","####","$ENHA"]},
    {"options":["nomeDaVariável", "altura.","ALTURA-Jogador","_alt_jog_","Altura{Jogador}","altura_jogador"]},
    {"options":["nomeDaVariável", "altura.","ALTURA-Jogador","_alt_jog_","Altura{Jogador}","altura_jogador"]},
    {"options":[null,null,null,null,null]},
    {"options":["Condição","(chamaAcesa)","(quantGalinhas >= 5 || codigo == '/')","(quantGalinhas < 0 && codigo == '!')","(alturaJogador == 0.00)","(quantGalinhas > 30)"]},
    {"options":["Condição","(quantGalinhas == 0 && !chamaAcesa)","(alturaJogador > 50.0 && codigo == '!')","(tamanho(NOME_JOGADOR) != 7)","(alturaJogador < 0.00 || codigo != '!')","(tamanho(NOME_JOGADOR) <= 7)"]},
    {"options":["(correr())","(ficar() || correr())","(!ficar() && !correr())","((ficar() && correr()) || ficar())","((ficar() || correr()) || ficar())"]},
    {"options":["Iteração", "for(int i = 0; i < 6; i++)","while(houverRocha())","for(int i = 5; i <= 0; i--)", "while(houverVacuo())", "for(int i = 10; i >= 0; i++)"]},
    {"options":["Iteração", "(int i = 0; i < 8; i++)", "(int i = 1; i < 8; i++)", "(int i = 1; i <= 8; i++)", "(int i = 0; i < 4; i++)", "(int i = 0; i > 4; i++)"]},
    {"options":["Iteração","(int i = 0; i < 7; i++)","(int i = 0; i < 6; i++)","(int i = 0; i < 4; i++)", "(int i = 0; i <= 7; i++)", "(int i = 6; i >= 3; i--)"]}
    ],
    "constIdentifier": "const",
    "optionsCondition2":
    [
        {"options":["(ficar())","(ficar() && correr())", "(!ficar() || !correr())", "((ficar() && correr()) && ficar())", "((ficar() || correr()) && ficar())"]},
        {"options": null},
        {"options": null},
        {"options":["Iteração","(int j = 0; j < 13; j++)", "(int j = 11; j >= 8; j--)", "(int j = 0; j < 12; j++)", "(float j = 0; j < 12; j++)", "(int j = 11; j <= 0; j++)"]}
    ],   
    "inputTypes":[{"options":["tipoDaVariável", "char *", "int", "float", "char"]},
    {"options":["tipoDaVariável", "string", "int", "double", "char", "bool"]},
    {"options":[null, null, null, null, null, null]},
    {"options":["tipoDaVariável", "String", "int", "double", "char", "boolean"]}
    ],
    "statementsStructures1":["if", "if", "if", null, "for", "for"],
    "statementsStructures2":[null, "else", "else if", null, null, "for"],
    "resultsStructures1":["pararBloco();", "prenderObjeto();", "oBichoPega();", "criarBloco();", "eliminarLamina()", null],
    "resultsStructures2":[null, "liberarObjeto();", "oBichoCome();", null, null, "destruirBloco(i, j);"],
    "genericTips":["Nessa linguagem, o valor precisa terminar com ponto e vírgula (;)"],
    "tips":[
        {   "tipsForTypes": null,
            "tipsForNames": null,
            "tipsForValue": 
                ["Todo valor textual precisa estar entre aspas duplas",
                "Você estourou o limite máximo de 7 caracteres",
                "Exemplo: \"Maria\""]
        },
        {
            "tipsForTypes": 
                ["Galinhas ainda podem aparecer no jogo, então não é uma constante",
                "Quantidade é um valor numérico, logo não deve ser do tipo texto",
                null, 
                "Não existe 1 uma galinha e meia, então não deve ser do tipo decimal",
                "Quantidade é um valor numérico, não deve ser representado como caractere",
                null],
            "tipsForNames":
                    ["Nomes de variável não podem começar com número",
                    "Nomes de variável não permitem caracteres especiais como |",
                    null,
                    null, 
                    "Nomes de variável não permitem caracteres especiais além do underline"
                    ],
             "tipsForValue":
                    ["Seu valor só deve conter números",
                     "Não faz sentido haver quantidade negativa de galinhas",
                     "Você estourou a capacidade de armazenamento de um inteiro, cerca de 2³¹"
                    ]
        },
        {
            "tipsForTypes": 
                ["O valor da chama ainda pode ser modificado, não é constante",
                "O estado da chama não é definido por um texto",
                null,
                "Só existem 2 estados possíveis, você não precisa do tipo decimal", 
                "Não existe 1 uma galinha e meia, então não deve ser do tipo decimal",
                "É um conjunto de caracteres ou um número",
                null],
            "tipsForNames":
                [null,
                "Nomes de variável não permitem parênteses",
                null,
                "Nomes de variável não permitem parênteses", 
                "Nomes de variável não permitem caracteres especiais como ."
                ],
             "tipsForValue":
                ["Seu valor só deve conter um digíto numérico",
                 "A linguagem C interpreta 0 como falso e 1 como verdadeiro",
                 "Em Python, True é verdadeiro e False é falso",
                 "Nessa linguagem, true é verdadeiro e false é falso",
                 "O valor depende do nome da variável"
                ]
        },
        {
            "tipsForTypes": 
                ["É dito que o código não vai mudar",
                 "O código só possui um caractere, então o tipo textual não se aplica",
                 "O caractere pode não ser numérico",
                 "É um caractere, não necessita de precisão decimal",
                 null,
                 "O valor deve representar apenas um caractere"
                ],
            "tipsForNames":
                [null,
                "Nomes de variável não podem conter caracteres especiais como $",
                "Nomes de variável não podem conter caracteres acentuados",
                "Nomes de constante não permitem caracteres especiais além do underline", 
                "Nomes de variável não podem conter caracteres especiais como $"
                ],
             "tipsForValue":
                ["O valor deve estar entre aspas simples, por ser caractere",
                 "Não deve haver mais de um caractere",
                 "Cada frase representa uma parte do nome do caractere",
                 "O símbolo é composto de uma reta e de um ponto"
                ]
        },
        {
            "tipsForTypes": 
                ["Você não vai ficar pequeno para sempre, então não é constante",
                 "Altura é um valor numérico",
                 "Geralmente existe altura quebrada, como 1.75 m.",
                 null,
                 "Altura é um valor apenas numérico.", 
                 "Altura é um valor apenas numérico."
                ],
            "tipsForNames":
                ["Nomes de variável não podem conter caracteres especiais como .",
                "Nomes de variável não podem conter caracteres especiais como travessão (-)",
                null,
                "Nomes de variável não podem conter caracteres especiais como chaves {}", 
                null
                ],
             "tipsForValue":
                ["Valores decimais são representados com ponto, não vírgula",
                 "Você deve fazer uma subtração",
                 "O valor é do tipo (XX.X) ou do tipo (XXX.X - XX.X)"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
               null,
             "tipsForValue":
                ["Valores decimais são representados com ponto, não vírgula",
                 "Você deve fazer uma multiplicação",
                 "O valor é do tipo (nomeDaVariável) * (X.XX)"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["Os valores não podem ser diferentes de A99, A98 e A97",
                 "Não se deve retirar as aspas duplas, pois o valor é textual",
                 "Você pode pôr o mesmo nome em mais de uma câmera",
                 "Para uma câmera não te ver troque por outra mais distante",
                 "A99 e A98 não podem te ver, então só resta A97"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["Enquanto a chama estiver acesa, você poderá se salvar",
                 "Você consegue criar pelo menos 5 galinhas em tempo hábil?",
                 "A quantidade de galinhas pode ser negativa?",
                 "Se a sua altura for 0, você deixará de existir",
                 "Até que você crie 30 galinhas, já caiu"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["Você deve negar a proposição para conseguir se libertar",
                 "Se a altura for menor do que 50 é possível ficar livre",
                 "Se o tamanho do seu nome for 7 caracteres, é possível ficar livre",
                 "Existe uma condição que sempre te deixará livre no jogo",
                 "Cuidado com condições que nunca podem ser negadas"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["Se uma das ações for verdade, a outra será automaticamente falsa",
                 "Se uma das ações não acontece, a outra consequentemente acontece",
                 "Uma expressão do tipo E sempre retornará falso",
                 "Tome cuidado com expressões do tipo OU, porque basta que uma seja verdadeira",
                 "Verifique as condições considerando ficar, depois correr",
                 "Escolha as expressões de modo que todas retornem falso"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["Você sabe se criar 6 blocos é suficiente?",
                 "Tome cuidado com loops infinitos. Sempre haverá rocha.",
                 "Sempre cheque a condição de parada do loop",
                 "Preencher com rochas até encontrar algo parece uma boa ideia",
                 "Cuidado com loops infinitos. O indíce i pode sempre ser maior que 0"
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["Você deve remover todas as 8 lâminas para continuar",
                 "Quando o índice começa em 1, o valor final da quantidade deve ser incluído",
                 "É necessário remover todas as lâminas",
                 "Apenas 4 lâminas é suficiente para liberar o caminho?",
                 "Cuidado com loops infinitos. O comando precisa parar em algum momento."
                ]
        },
        {
            "tipsForTypes": 
                null,
            "tipsForNames":
                null,
             "tipsForValue":
                ["O indíce i corresponde à altura",
                 "Não faz diferença sobrar alguns ladrilhos embaixo",
                 "Eliminar apenas 4 linhas de ladrilhos de cima resolve o problema?",
                 "Perceba que o indíce começa em 0, logo o loop pode ultrapassar o vetor.",
                 "Quebrar as 4 últimas linhas de ladrilhos pode ser suficiente",
                 null,
                 "Remover apenas 4 ladrilhos por linha é suficiente?",
                 "O índice j corresponde à largura",
                 "Indíces de vetor são sempre números inteiros",
                 "Cuidado com loops que nunca chegam a acontecer"
                ]
        }
    ],
    "titleInfo":["Variáveis", "Condicionais", "Repetição", "Controles"],
    "descriptionInfo":[
        "Tipo int: representa números inteiros até cerca de 2^31. Também pode representar valor booleano, sendo 0 (falso) e 1 (verdadeiro)\n\nTipo char: representa um caractere de acordo com a tabela ASCII entre aspas simples\n\nTipo float: representa números decimais. Deve-se utilizar ponto entre os números\n\nTipo char*: representa um conjunto de caracteres (palavra). Escreve-se entre aspas duplas\n",
        "if: condição \"se\" é verdadeiro faça algo\n\nelse if: condição \"senão se\" que vem após um if que não foi executado e testa outra condição\n\nelse: condição \"senão\" que faz algo caso nenhuma das condições anteriores seja verdadeira\n\n==: representa igualdade, se algo é igual a outro\n\n&&: representa a condição E, só retorna verdadeiro se as duas proposições são verdadeiras\n\n||: representa a condição OU, basta que uma proposição seja verdadeira para retornar verdadeiro\n\n!: nega a proposição, se é verdadeira torna-se falsa e vice-versa.\n\n<: se um valor é menor do que o outro\n\n>: se um valor é maior do que o outro\n\n>=: se um valor é maior ou igual a outro\n\n<=: se um valor é menor ou igual a outro",
        "while(condição): enquanto a condição for verdadeira, repete a ação\n\nfor(int i = valor_inicial; condição; incrementa 1 (++) ou decrementa 1 (--)): repete um número de vezes estabelecido determinado pela condição",
        "X: Ataque com a espada\n\nC: Atirar galinhas\n\nE: Acender Chama\n\nQ: Aumentar Altura\n\nZ: Diminuir Altura"
    ],
    "namesCameras":["char* CAMERA_A99", "char* CAMERA_A98", "char* CAMERA_A97"]
}